const questionsDataJa = [
    {
        text: '淡島ホテルが開業したのはいつでしょう。',
        options: ['1991年(平成3年)', '1995年(平成7年)', '1987年(昭和62年)', '2000年(平成12年)'],
        correct: '1991年(平成3年)',
        explanation: '淡島ホテルは1991年(平成3年)に開業しました。1991年は日本ではバブル崩壊が始まった年、世界では湾岸戦争勃発した年になります。'
    },
    {
        text: '淡島ホテルは静岡県のどこの地区に属すでしょう',
        options: ['沼津市静浦地区', '沼津市戸田地区', '沼津市第1・２地区', '沼津市内浦地区'],
        correct: '沼津市内浦地区',
        explanation: '淡島ホテルは「静岡県沼津市内浦地区」の重寺という場所に属しています。以前は内浦村でしたが1955年に沼津市に編入合併され沼津市内浦地区になりました。'
    },
    {
        text: '淡島ホテルの蛇口からでる水はある湧水群の水です。それはどこでしょう',
        options: ['柿田川湧水群', '狩野川湧水群', '箱根湧水群', '井川湧水群'],
        correct: '柿田川湧水群',
        explanation: '正解は「柿田川湧水群」です。この湧水群は沼津市の隣の清水町に位置し富士山からの雪解け水が湧き出ます。柿田川はこの湧水を水源とし日本三大清流に数えられており、日本一の湧水量を誇ります。'
    },
    {
        text: '淡島ホテルはあるものをテーマにしています。それは何でしょう。',
        options: ['スポーツ', '食文化', '芸術と音楽', '歴史と伝統'],
        correct: '芸術と音楽',
        explanation: '淡島ホテルは「芸術と音楽」をテーマにしています。館内には様々な芸術作品が展示されております。'
    },
    {
        text: '淡島ホテルは何階建でしょう。',
        options: ['5階建', '6階建', '7階建', '8階建'],
        correct: '7階建',
        explanation: '淡島ホテルは7階建てです。７階にはホテル創業者が以前住んでいた特別室があります。'
    },
    {
        text: '淡島ホテルの庭にあるこの作品はある日本の彫刻家の作品です。その人物は誰でしょうか。',
        image: 'assets/yasuda_art.jpg',
        options: ['岡本太郎(おかもとたろう)', '安田侃(やすだかん)', '草間彌生(くさまやよい)', '佐藤忠良(さとうちゅうりょう)'],
        correct: '安田侃(やすだかん)',
        explanation: 'こちらは「安田侃」の彫刻です。安田侃は北海道出身でイタリアを拠点に活動している彫刻家です。写真の作品は人間の心(球体)の逃れられないしがらみ(刺さっている棒)を表しています。'
    },

    {
        text: '淡島ホテルの1階部分はどのくらいの床面積があるでしょうか。',
        options: ['約3,000㎡', '約2,000㎡', '約1,500㎡', '約5,000㎡'],
        correct: '約3,000㎡',
        explanation: '淡島ホテルの1階部分は約3,000㎡の床面積を有しています。'
    },
    {
        text: '以前は船以外の方法でも島に渡ることができました。その方法とは何だったでしょう。',
        options: ['ロープウェイ', '徒歩橋', '海中トンネル', 'ジェットスキー'],
        correct: 'ロープウェイ',
        explanation: '2008年までロープウェイが島までの移動手段の一つとして使われておりました。老朽化に伴い現在は閉鎖されております。島の中部に見えるピンクの建物は以前のロープウェイ降り場です。'
    }
];

const textsDataJa = {
    welcome: 'ようこそ！',
    startQuizButton: '回答を始める',
    roomNumberPlaceholder: 'ルームナンバーを入力してください',
    namePlaceholder: 'お名前を入力してください',
    quizTitle: 'クイズを開始します',
    submitButton: '回答',
    nextButton: '次へ',
    showResultsButton: '結果を見る',
    correct: '正解！',
    incorrect: '不正解！',
    explanation: '解説',
    resultsTitle: '結果',
    yourScore: 'あなたのスコア',
    questionLabel: '質問',
    yourAnswer: 'あなたの回答',
    correctAnswer: '正解'
};
